[toc]





# 01.APC的本质

1. 线程是不能被“杀掉”、“挂起”、“恢复”的，线程在执行的时候自己占据着CPU，别人不能控制它
2. 举个极端的例子：如果不调用API，屏蔽中断，并保证代码不出现异常，线程将永久占用CPU
3. 所以说线程如果想“死”，一定是自己执行代码把自己杀死，不存在“他杀”的情况

**思考**：那如果想改变一个线程的行为该怎么办
**答案**：可以给他提供一个函数，让它自己去调用：APC（Asyncroneus Procedure Call，异步过程调用）

## APC队列

- `ApcListHead`：
  1. 由两个双向链表组成，共占16个字节
  2. 提供的APC函数可能是**用户函数**，也可能是**系统函数**（简单的区分方法就是判断函数地址是否大于**0x80000000**）
- `Process`：指向线程所属或者挂靠进程
- `KernelApcInProgress`：内核Apc是否正在执行
- `KernelApcPending`：是否存在等待状态的**内核APC**，存在则置1
- `UserApcPending`：是否存在等待状态的**用户APC**，存在则置1

```c
kd> dt _KTHREAD
ntdll!_KTHREAD
   ...
   +0x034 ApcState         : _KAPC_STATE
   ...
kd> dt _KAPC_STATE
ntdll!_KAPC_STATE
   +0x000 ApcListHead      : [2] _LIST_ENTRY
   +0x010 Process          : Ptr32 _KPROCESS
   +0x014 KernelApcInProgress : UChar
   +0x015 KernelApcPending : UChar
   +0x016 UserApcPending   : UChar
```



## APC结构

```c
kd> dt _KAPC
ntdll!_KAPC
   +0x000 Type             : Int2B
   +0x002 Size             : Int2B
   +0x004 Spare0           : Uint4B
   +0x008 Thread           : Ptr32 _KTHREAD
   +0x00c ApcListEntry     : _LIST_ENTRY
   +0x014 KernelRoutine    : Ptr32     void 
   +0x018 RundownRoutine   : Ptr32     void 
   +0x01c NormalRoutine    : Ptr32     void //找到提供的APC函数，并不完全等于APC函数的地址
   +0x020 NormalContext    : Ptr32 Void
   +0x024 SystemArgument1  : Ptr32 Void
   +0x028 SystemArgument2  : Ptr32 Void
   +0x02c ApcStateIndex    : Char
   +0x02d ApcMode          : Char
   +0x02e Inserted         : UChar
```

当前线程什么时候将会执行提供的APC

1. `KiServiceExit` 函数（**系统调用**、**异常**或**中断**返回用户控件的必经之路）
2. `KiDeliverApc` 函数（负责**执行**APC函数）

## KiServiceExit

```asm
.text:004069CD loc_4069CD:                             ; CODE XREF: _KiServiceExit+8↑j
.text:004069CD                                         ; _KiServiceExit+64↓j
.text:004069CD                 mov     ebx, large fs:124h ; 获取ETHREAD
.text:004069D4                 mov     byte ptr [ebx+_KTHREAD.Alerted], 0
.text:004069D8                 cmp     byte ptr [ebx+_KTHREAD.ApcState.UserApcPending], 0 ; 检查是否有APC请求
.text:004069DC                 jz      short loc_406A23
.text:004069DE                 mov     ebx, ebp
.text:004069E0                 mov     [ebx+44h], eax  ; 堆栈中_KTRAP_FREAME结构的eax
.text:004069E3                 mov     dword ptr [ebx+50h], 3Bh ; ';' ; 堆栈中_KTRAP_FREAME结构的SegFs
.text:004069EA                 mov     dword ptr [ebx+38h], 23h ; '#' ; 堆栈中_KTRAP_FREAME结构的SegDs
.text:004069F1                 mov     dword ptr [ebx+34h], 23h ; '#' ; 堆栈中_KTRAP_FREAME结构的SegEs
.text:004069F8                 mov     dword ptr [ebx+30h], 0 ; 堆栈中_KTRAP_FREAME结构的SegGs
.text:004069FF                 mov     ecx, 1          ; APC_LEVEl参数
.text:00406A04                 call    ds:__imp_@KfRaiseIrql@4 ; KfRaiseIrql(x)
.text:00406A0A                 push    eax
.text:00406A0B                 sti                     ; 关中断
.text:00406A0C                 push    ebx
.text:00406A0D                 push    0
.text:00406A0F                 push    1
.text:00406A11                 call    _KiDeliverApc@12 ; 执行内核APC并为用户空间的APC的执行进行准备
.text:00406A16                 pop     ecx             ; 将老的运行级别出栈
.text:00406A17                 call    ds:__imp_@KfLowerIrql@4 ; 恢复原来的运行级别
.text:00406A1D                 mov     eax, [ebx+44h]
.text:00406A20                 cli                     ; 开中断
.text:00406A21                 jmp     short loc_4069CD ; 获取ETHREAD
```



# 02.备用APC队列

还是先看下线程结构体：

```c
kd> dt _kthread
nt!_KTHREAD
...
+0x034 ApcState         : _KAPC_STATE//APC
...
+0x138 ApcStatePointer  : [2] Ptr32 _KAPC_STATE//APC指针
...
+0x14c SavedApcState    : _KAPC_STATE//备用APC
...
+0x165 ApcStateIndex    : UChar//线程状态
+0x166 ApcQueueable     : UChar//当前成员是否允许插入APC
...
```

## SavedApcState

1. 在 `_KTHREAD+0x14c` 位置处，同样也存在一个 `_KAPC_STATE` 结构体，叫做 `SavedApcState`
2. **线程APC队列中的APC函数都是与进程相关联的**，具体点说：A进程的T线程中的所有APC函数，要访问的内存地址都是A进程的
3. 但线程是可以挂靠到其他的进程：比如A进程的线程T，通过修改Cr3(改为B进程的页目录基址)，就可以访问B进程地址空间，即所谓“进程挂靠”
4. 当T线程挂靠B进程后，APC队列中存储的却仍然是原来的APC。具体点说，比如某个APC函数要读取一个地址为0x12345678的数据，如果此时进行读取，读到的将是B进程的地址空间，这样逻辑就错误了
5. 为了避免混乱，在T线程挂靠B进程时，会将`ApcState`中的值暂时存储到`SavedApcState`中，等回到原进程A时，再将APC队列恢复。
6. 因此，`SavedApcState`又称为备用APC队列

```
A进程的T线程挂靠B进程  
	A是T的所属进程  
	B是T的挂靠进程
ApcState    	B进程相关的APC函数     
SavedApcState	A进程相关的APC函数
```

## ApcStateIndex

**ApcStateIndex** 用来标识当前线程处于什么状态，位于 **_KTHREAD+0x165**

**0**：正常状态
**1**：挂靠状态

## ApcStatePointer

为了操作方便，**_KTHREAD** 结构体中定义了一个指针数组 **ApcStatePointer** ，长度为2，位于 **_KTHREAD+0x138**

正常情况下：

- `ApcStatePointer[0]` 指向 ApcState
- `ApcStatePointer[1]` 指向 SavedApcState

挂靠情况下：

- `ApcStatePointer[0]` 指向 SavedApcState
- `ApcStatePointer[1]` 指向 ApcState

### 组合寻址

这样和`ApcStateIndex`就可以组合寻址了：

正常情况下，向`ApcState`队列中插入APC时：

- `ApcStatePointer[0]` 指向 `ApcState`，此时 `ApcStateIndex` 的值为 0
- `ApcStatePointer[ApcStateIndex]` 指向 `ApcState`

挂靠情况下，向`ApcState`队列中插入APC时：

- `ApcStatePointer[1]` 指向 `ApcState`，此时 `ApcStateIndex` 的值为 1
- `ApcStatePointer[ApcStateIndex]` 指向 `ApcState`

总结下来就是，无论什么环境下，**ApcStatePointer[ApcStateIndex]** 指向的都是 **ApcState**
**ApcState** 总是表示线程当前使用的apc状态

## ApcQueueable

1. 位于 `_KTHREAD+0x166`，表示是否可以向线程的APC队列中插入APC
2. 当线程正在执行退出的代码时，会将这个值设置为0 ，如果此时执行插入APC的代码（`KeInsertQueueApc`），在插入函数中会判断这个值的状态，如果为0，则插入失败

# 03.APC挂入过程

1. 无论是正常状态还是挂靠状态，都有两个APC队列，一个**内核队列**，一个**用户队列**
2. 每当要挂入一个APC函数时，不管是内核APC还是用户APC，内核都要准备一个**KAPC**的数据结构，并且将这个KAPC结构挂到相应的APC队列中

```c
kd> dt _KAPC
ntdll!_KAPC
	+0x000 Type             : Int2B				//类型 APC类型为0x12
	+0x002 Size             : Int2B				//本结构体的大小  0x30
	+0x004 Spare0           : Uint4B			//未使用
	+0x008 Thread           : Ptr32 _KTHREAD	//目标线程
	+0x00c ApcListEntry     : _LIST_ENTRY		//APC队列挂的位置
	+0x014 KernelRoutine    : Ptr32     void 	//指向一个函数(调用ExFreePoolWithTag)APC执行完毕后，释放本结构内存
	+0x018 RundownRoutine   : Ptr32     void 	//略
	+0x01c NormalRoutine    : Ptr32     void 	//用户APC总入口  或者 真正的内核apc函数
	+0x020 NormalContext    : Ptr32 Void		//内核APC：NULL  用户APC：真正的APC函数
	+0x024 SystemArgument1  : Ptr32 Void		//APC函数的参数1
	+0x028 SystemArgument2  : Ptr32 Void		//APC函数的参数2
	+0x02c ApcStateIndex    : Char				//挂哪个队列，有四个值：0 1 2 3
	+0x02d ApcMode          : Char				//内核APC 用户APC
	+0x02e Inserted         : UChar				//表示本apc是否已挂入队列 挂入前：0  挂入后  1

```

- **NormalRoutine**:
  - 如果当前的APC是内核APC，通过它就能找到内核APC函数。
  - 如果当前的APC是用户APC，通过它找到的只是**用户APC的总入口**并不是用户APC函数。
- **NormalContext**：如果是内核APC这个值为空；如果是用户APC这个值执行的就是用户APC函数
- **+0x02c ApcStateIndex**（**KTHREAD(+0x165)** 的属性同名，但含义不一样）：
  - =0：原始环境
  - =1：挂靠环境
  - =2：当前环境
  - =3：插入APC时的当前环境



## 挂入过程

- **用户层调用**：`QueueUserAPC`（kernel32.dll）=>`NtQueueApcThread`（ntosker.exe）=>内核层
- **很多内核函数调用**：`KeInitializeApc`（分配空间，初始化KAPC结构体）=>`KeInsertQueueApc`=>`KiInsertQueueApc`（将KAPC插入指定APC队列）

### KeInitializeApc

```c
VOID KeInitializeApc
(
	IN PKAPC Apc,							//KAPC指针
	IN PKTHREAD Thread,						//目标线程
	IN KAPC_ENVIRONMENT TargetEnvironment,	//0 1 2 3四种状态
	IN PKKERNEL_ROUTINE KernelRoutine,		//销毁KAPC的函数地址
	IN PKRUNDOWN_ROUTINE RundownRoutine OPTIONAL,
	IN PKNORMAL_ROUTINE NormalRoutine,		//用户APC总入口或者内核apc函数
	IN KPROCESSOR_MODE Mode,				//要插入用户apc队列还是内核apc队列
	IN PVOID Context						//内核APC：NULL  用户APC：真正的APC函数
) 
```

1. `Thread`传进来会挂到 `_KAPC.0x8 Thread`
2. `TargetEnvironment` 传进来会挂到`_KAPC.0x2c ApcStateIndex`
3. `KernelRoutine` 传进来会挂到`_KAPC.0x14 KernelPoutine`
4. `NormalRoutine` 传进来会挂到`_KAPC.0x1c NormalRoutine`
5. `Mode` 传进来会挂到`_KAPC.0x2d ApcMode`
6. `Context` 传进来会挂到`_KAPC.0x20 NormalRoutine`

#### ApcStateIndex

0表示原始环境，1表示挂靠环境，这两个比较好理解，下面说一下2和3：

当值为2的时候，插入的是当前进程的队列。什么是当前队列，是我不管你环境是挂靠还是不挂靠，我就插入当前进程的`APC`队列里面，以初始化`APC`的时候为基准。

当值为3时，插入的是当前进程的`APC`队列，此时有修复`ApcStateIndex`的操作，以插入`APC`的时候为基准。

### KeInsertQueueApc

1. 根据`KAPC`结构中的`ApcStateIndex`找到对应的APC队列
2. 再根据`KAPC`结构中的`ApcMode`确定是用户队列还是内核队列
3. 将`KAPC`挂到对应的队列中(挂到`KAPC`的`ApcListEntry`处)
4. 再根据`KAPC`结构中的`Inserted`置1，标识当前的KAPC为已插入状态
5. 修改`KAPC_STATE`结构中的`KernelApcPending`/`UserApcPending`

```asm
.text:00402C6A var_4           = dword ptr -4
.text:00402C6A
.text:00402C6A ; FUNCTION CHUNK AT .text:0040EEB3 SIZE 00000031 BYTES
.text:00402C6A ; FUNCTION CHUNK AT .text:0041049E SIZE 0000002C BYTES
.text:00402C6A ; FUNCTION CHUNK AT .text:004106A4 SIZE 00000031 BYTES
.text:00402C6A ; FUNCTION CHUNK AT .text:00412E89 SIZE 00000013 BYTES
.text:00402C6A ; FUNCTION CHUNK AT .text:0041C2D7 SIZE 0000001A BYTES
.text:00402C6A ; FUNCTION CHUNK AT .text:0042615A SIZE 0000000F BYTES
.text:00402C6A ; FUNCTION CHUNK AT .text:0042950C SIZE 0000001E BYTES
.text:00402C6A ; FUNCTION CHUNK AT .text:00432270 SIZE 0000000F BYTES
.text:00402C6A ; FUNCTION CHUNK AT .text:0044B3BF SIZE 0000001A BYTES
.text:00402C6A
.text:00402C6A                 mov     edi, edi
.text:00402C6C                 push    ebp
.text:00402C6D                 mov     ebp, esp
.text:00402C6F                 push    ecx
.text:00402C70                 mov     eax, ecx
.text:00402C72                 cmp     byte ptr [eax+2Eh], 0
.text:00402C76                 mov     ecx, [eax+8]
.text:00402C79                 mov     [ebp+var_4], edx
.text:00402C7C                 jnz     loc_44B3BF
.text:00402C82                 cmp     [eax+_KAPC.ApcStateIndex], 3 ; 判断APCStateIndex是否为3
.text:00402C86                 jz      loc_44B3C3      ; 取出当前进程的ApcStateIndex
.text:00402C8C
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
.text:0044B3C3 loc_44B3C3:                             ; CODE XREF: KiInsertQueueApc(x,x)+1C↑j
.text:0044B3C3                 mov     dl, [ecx+_ETHREAD.Tck.ApcStateIndex] ; 取出当前进程的ApcStateIndex
.text:0044B3C9                 mov     [eax+_KAPC.ApcStateIndex], dl ; 放入APC中
.text:0044B3CC                 jmp     loc_402C8C
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
.text:00402C8C loc_402C8C:                             ; CODE XREF: KiInsertQueueApc(x,x)+48762↓j
.text:00402C8C                 cmp     [eax+_KAPC.NormalRoutine], 0s
.text:00402C90                 movsx   edx, [eax+_KAPC.ApcStateIndex]
.text:00402C94                 push    ebx
.text:00402C95                 push    esi
.text:00402C96                 push    edi
.text:00402C97                 mov     edi, [ecx+edx*4+_KTHREAD.ApcStatePointer] ; l) 根据_ KAPC.ApcStateIndex找到要挂APC的队列: SaveApc/Apc
.text:00402C9E                 mov     dl, [eax+_KAPC.ApcMode]
.text:00402CA1                 jnz     loc_41049E
.text:00402CA7                 movsx   esi, dl
.text:00402CAA                 lea     edi, [edi+esi*8] ; 2)根据ApcMode找到是用户APC队列还是内核APC队列
.text:00402CAD                 mov     esi, [edi+4]
.text:00402CB0
.text:00402CB0 loc_402CB0:                             ; CODE XREF: KiInsertQueueApc(x,x)+4876A↓j
.text:00402CB0                 cmp     esi, edi
.text:00402CB2                 jnz     loc_42615A
.text:00402CB8
.text:00402CB8 loc_402CB8:                             ; CODE XREF: KiInsertQueueApc(x,x)+234F4↓j
.text:00402CB8                 mov     ebx, [esi]
.text:00402CBA                 lea     edi, [eax+_KAPC.ApcListEntry]
.text:00402CBD                 mov     [edi], ebx
.text:00402CBF                 mov     [edi+4], esi
.text:00402CC2                 mov     [ebx+4], edi
.text:00402CC5                 mov     [esi], edi      ; 3)将ApcStateIndex 挂到对应的队列中：ApcListEntry
.text:00402CC7
.text:00402CC7 loc_402CC7:                             ; CODE XREF: KiInsertQueueApc(x,x)+D85B↓j
.text:00402CC7                                         ; KiInsertQueueApc(x,x)+268BB↓j
.text:00402CC7                 movsx   edi, [eax+_KAPC.ApcStateIndex]
.text:00402CCB                 mov     [eax+_KAPC.Inserted], 1 ; 4)修改Inserted的值
.text:00402CCF                 movzx   esi, [ecx+_KTHREAD.ApcStateIndex]
.text:00402CD6                 cmp     edi, esi
.text:00402CD8                 pop     edi
.text:00402CD9                 pop     esi
.text:00402CDA                 pop     ebx
.text:00402CDB                 jnz     short loc_402D12
.text:00402CDD                 test    dl, dl
.text:00402CDF                 jnz     loc_4106A4      ; 若为用户模式APC，跳转
.text:00402CE5                 mov     dl, [ecx+_KTHREAD.State]
.text:00402CE8                 cmp     dl, 2
.text:00402CEB                 mov     [ecx+_KTHREAD.ApcState.KernelApcPending], 1 ; 5)内核模式APC，修改KernelApcPending为1
.text:00402CEF                 jnz     loc_40EEB3
.text:00402CF5                 mov     eax, large fs:_KTHREAD.Teb
.text:00402CFB                 mov     cl, [ecx+_KTHREAD.NextProcessor]
.text:00402D01                 cmp     [eax+10h], cl
.text:00402D04                 jnz     loc_412E89
.text:00402D0A                 mov     cl, 1
.text:00402D0C                 call    ds:__imp_@HalRequestSoftwareInterrupt@4 ; HalRequestSoftwareInterrupt(x)
.text:004106A4 ; START OF FUNCTION CHUNK FOR KiInsertQueueApc(x,x)
.text:004106A4
.text:004106A4 loc_4106A4:                             ; CODE XREF: KiInsertQueueApc(x,x)+75↑j
.text:004106A4                 cmp     [ecx+_KTHREAD.State], 5 ; 判断线程是否为等待状态如果不是则跳转
.text:004106A8                 jnz     loc_402D12
.text:004106AE                 cmp     [ecx+_KTHREAD.WaitMode], 1 ; 判断是否是用户导致的等待如果不是则跳转
.text:004106B2                 jnz     loc_402D12
.text:004106B8                 cmp     [ecx+_KTHREAD.Alertable], 0 ; 判断是否可以吵醒线程(Alertble=1)如果不是 则跳转
.text:004106BF                 jz      loc_432270
.text:004106C5
.text:004106C5 loc_4106C5:                             ; CODE XREF: KiInsertQueueApc(x,x)+2F610↓j
.text:004106C5                 mov     [ecx+_KTHREAD.ApcState.UserApcPending], 1
.text:004106C9                 push    0
.text:004106CB                 mov     edx, 0C0h
.text:004106D0                 jmp     loc_40EED7
.text:0040EED7 loc_40EED7:                             ; CODE XREF: KiInsertQueueApc(x,x)+DA66↓j
.text:0040EED7                 push    [ebp+var_4]
.text:0040EEDA                 call    @KiUnwaitThread@16 ; 将当前线程从等待链表转移到就绪列表
.text:0040EEDA                                         ; 即唤醒线程
.text:0040EEDF                 jmp     loc_402D12
```



### Alertable

该值指示线程是否运行被`APC`吵醒

1. `Alertable=0`，`UserApcPending = 0`：当前插入的APC函数未必有机会执行
2. `Alertable=1` ，`UserApcPending = 1`：将目标线程唤醒(从等待链表中摘出来，并挂到调度链表)

该属性在KTHREAD中：

```c
kd> dt _KTHREAD
ntdll!_KTHREAD
   ...
   +0x164 Alertable        : UChar
   ...
```

很多与线程相关的结尾带`Ex`的函数的参数都会有一个`bAlertable`，举例如下：

```c
DWORD SleepEx(
  DWORD dwMilliseconds, // time-out interval
  BOOL bAlertable        // early completion option
);
DWORD WaitForSingleObjectEx(
  HANDLE hHandle,       // handle to object
  DWORD dwMilliseconds, // time-out interval
  BOOL bAlertable       // alertable option
);
```



# 04.内核APC执行过程

 



## 何时执行APC

`APC`函数的执行与插入并不是同一个线程，具体点说在A线程中向B线程插入一个`APC`，插入的动作是在A线程中完成的，但什么时候执行则由B线程决定，所以叫“异步过程调用”

### 线程切换

1. `SwapContext` 判断是否有内核APC
2. `KiSwapThread`
3. `KiDeliverApc` 执行内核APC函数

先看下`SwapContext`的最后部分：

```asm
                cmp     [esi+_KTHREAD.ApcState.KernelApcPending], 0
                jnz     short loc_46A9BD
                popf
                xor     eax, eax
                retn
; ---------------------------------------------------------------------------

